1)Напишите программу, которая считывает строку-разделитель и три строки, а затем выводит указанные строки через разделитель.

# Считываем строку-разделитель
delimiter = input("Введите строку-разделитель: ")

# Считываем три строки
string1 = input("Введите первую строку: ")
string2 = input("Введите вторую строку: ")
string3 = input("Введите третью строку: ")

# Выводим строки через разделитель
result = delimiter.join([string1, string2, string3])
print("Результат:", result)

2)Напишите программу, которая считывает целое число, после чего на экран выводится следующее и предыдущее целое число с пояснительным текстом.

number = int(input("Введите целое число: "))

next_number = number + 1
previous_number = number - 1

print("Следующее число после", number, ":", next_number)
print("Предыдущее число перед", number, ":", previous_number)

3)Даны две различные клетки шахматной доски. Напишите программу, которая определяет,
может ли ладья попасть с первой клетки на вторую одним ходом. Программа получает на вход четыре числа от 1 до 8 каждое,
задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести «YES», 
если из первой клетки ходом ладьи можно попасть во вторую, или «NO» в противном случае.

x1 = int(input("Введите номер столбца для первой клетки (от 1 до 8): "))
y1 = int(input("Введите номер строки для первой клетки (от 1 до 8): "))
x2 = int(input("Введите номер столбца для второй клетки (от 1 до 8): "))
y2 = int(input("Введите номер строки для второй клетки (от 1 до 8): "))

if x1 == x2 or y1 == y2:
 print("YES")
else:
 print("NO")

4)Напишите программу, которая определяет, является ли год с данным номером високосным.
Если год является високосным, то выведите «YES», иначе выведите «NO».
Год является високосным, если его номер кратен 4, но не кратен 100, или если он кратен 400. 

def is_leap_year(year):
    if (year % 4 == 0 and year % 100 != 0) or year % 400 == 0:
        return True
    else:
        return False

year = int(input("Введите год: "))

if is_leap_year(year):
    print("YES")
else:
    print("NO")

5)Напишите программу, которая принимает три положительных числа и определяет вид треугольника, длины сторон которого равны введенным числам.

a = float(input("Введите длину первой стороны: "))
b = float(input("Введите длину второй стороны: "))
c = float(input("Введите длину третьей стороны: "))

if a + b > c and a + c > b and b + c > a:
    if a == b == c:
        print("Треугольник является равносторонним")
    elif a == b or a == c or b == c:
        print("Треугольник является равнобедренным")
    else:
        print("Треугольник является разносторонним")
else:
    print("Треугольник с такими сторонами не существует")

6)Напишите программу, которая принимает целое число x и определяет, принадлежит ли данное число указанным промежуткам: от -30 до -2 и от 7 до 25.

number = int(input("Введите целое число: "))

if (-30 <= number <= -2) or (7 <= number <= 25):
    print("Число", number, "принадлежит указанным промежуткам")
else:
    print("Число", number, "не принадлежит указанным промежуткам")

7)С помощью цикла while разработать программу, которая будет вычислять сумму чисел нацело делящихся на 5.
Цикл задать от 0 до введенного с клавиатуры числа. Вот пример работы программы:
Введите последнее число последовательности: 200
Сумма чисел делящихся на 5 из последовательности [0, 200] равна 4100

last_number = int(input("Введите последнее число последовательности: "))

sum_of_numbers = 0
number = 0

while number <= last_number:
    if number % 5 == 0:
        sum_of_numbers += number
    number += 1

print("Сумма чисел делящихся на 5 из последовательности [0, ", last_number, "] равна", sum_of_numbers)

8)Написать одномерный массив из 5 элементов. Вывести первые три элемента.

array = [1, 2, 3, 4, 5]
first_three_elements = array[:3]
print(first_three_elements)

9)Напишите программу, в которой рассчитывается сумма и произведение цифр положительного трёхзначного числа.

def calculate_sum_and_product(number):
    # Check if the number is a positive three-digit number
    if isinstance(number, int) and 100 <= number <= 999:
        # Calculate the sum of the digits
        digit_sum = sum(int(digit) for digit in str(number))
        
        # Calculate the product of the digits
        digit_product = 1
        for digit in str(number):
            digit_product *= int(digit)
        
        return digit_sum, digit_product
    else:
        return None

# Test the function
number = 123
sum_result, product_result = calculate_sum_and_product(number)
print(f"Сумма цифр: {sum_result}")
print(f"Произведение цифр: {product_result}")

10)Напишите программу, которая определяет, являются ли три заданных числа (в указанном порядке) последовательными членами арифметической прогрессии.

if a3 - a2 == a2 - a1:

def check_arithmetic_progression(a1, a2, a3):
    if a3 - a2 == a2 - a1:
        return True
    else:
        return False

# Test the function
a1 = 1
a2 = 3
a3 = 5
is_arithmetic_progression = check_arithmetic_progression(a1, a2, a3)
print(is_arithmetic_progression)




